<?php

#新品
return [
	'cacheEnable' => true,
	#New product items | BF=>八方 ｜BG=>梁社漢
	#梁社漢須多處理複合店, 要多取八方DB
	#不需含套餐，因已會拆成單品項
	'products' => [
		
		'porkRibs' => [
			'saleDate' => '2025-09-08', #發售日
			'saleEndDate' => NULL, #停售日
			'name' => '橙汁排骨',
			'ids' => [
				'main' => ['UC06000126', 'UC06000127', 'UC00000042', 'UC00000043'], #梁社漢
				'mapping' => ['PS02100021', 'PS02100022', 'PS02200047', 'PS02200048'], #八方(複合店)
			],
			'brand' => 'BG', #表示屬梁社漢新品
		],
		
		'tomatoBeef' => [
			'saleDate' => '2025/10/13',
			'saleEndDate' => '', #停售日
			'name' => '番茄牛三寶',
			'ids' => [
				'main' => ['UC07100017', 'UC07100018', 'UC03000024', 'UC03000025', 'UC06100105', 'UC06100106'], #梁社漢
				'mapping' => ['PS02600009', 'PS02600010', 'PS04000046', 'PS04000047', 'PS02400026', 'PS02400027'], #八方(複合店)
			],
			'brand' => 'BG', #表示屬梁社漢新品
		],
		
		'braisedPork' => [
			'saleDate' => '2025/12/16',
			'saleEndDate' => '', #停售日
			'name' => '主廚秘製滷肉飯',
			'ids' => [
				'main' => ['UC01000005', 'UC01000006', 'UC06100107', 'UC06100108'], #梁社漢
				'mapping' => ['PS02400028', 'PS02400029'], #八方(複合店)
			],
			'brand' => 'BG', #表示屬梁社漢新品
		],
		
		'eggTofu' => [
			'saleDate' => '2025/12/16',
			'saleEndDate' => '', #停售日
			'name' => '老皮嫩肉',
			'ids' => [
				'main' => ['UC04000050', 'UC04000051'], #梁社漢
				'mapping' => ['PS02100023', 'PS02100024'], #八方(複合店)
			],
			'brand' => 'BG', #表示屬梁社漢新品
		],
    ],
	
	#複合店=> 八方:梁社漢 / 梁社漢的訂單銷售會存至poserp(只有梁社漢有此狀況)
	'multiBrandShopidMapping' => [
		
		#shop id 八方=>梁社漢
		'0001' => '106003', 
		'0966' => '112004',

    ],
];


/*
梁/八方
#椒鹽雞菲力排(3根)(單點)
UC00000040
UC00000041

PS02100019
PS02100020
#椒鹽雞菲力排飯
UC06000106
UC06000107
UC06000108
UC06000109
UC06000110
UC06000112
UC06000121
UC06000122
UC06000125

PS02200045
PS02200046
椒鹽雞菲力排麵
UC07000016
UC07000017
PS02500015
PS02500016

祕醬雞菲力排飯
UC06100093
UC06100094
UC06100097
PS02400024
PS02400025
祕醬雞菲力排麵
UC07100015
UC07100016
PS02600007
PS02600008
*/

/*
主廚秘製滷肉飯 Braised Pork
UC01000005
UC01000006
UC06100107
UC06100108
PS02400028
PS02400029
這四個料號

老皮嫩肉 Egg Tofu
UC04000050
UC04000051
PS02100023
PS02100024

秘製滷肉汁
UC02300008
*/